#include "output.h"

void print_menu()
{
    printf("------------------------------------\n");
    printf("1 - Вывести текущее состояние дерева\n");
    printf("2 - Вывести текущее состояние AVL-дерева\n");
    printf("3 - Вывести текущее состояние хэш-таблицы\n");
    printf("4 - Добавить новый элемент\n");
    printf("5 - Удалить элемент\n");
    printf("6 - Сравнить эффективность\n");
    printf("7 - Сменить максимальное количество сравнений для хэш-таблицы\n");
    printf("8 - Вывести различные способы обхода дерева\n");
    printf("0 - Выход\n");
    printf("Выберите пункт меню: ");
}
